// *****************************************************************************
// FILE -- /home/zero_rom/zero2np/src/ingame/map/CBuff.c
// *****************************************************************************

/* sdata 3eeac0 */ static int CBuffNum;
/* sdata 3eeac4 */ static int CBuffMaxLen;
/* sdata 3eeac8 */ static int CBuffMaxNum;
/* sbss 3f4a80 */ static char *CBuffStr;

// *****************************************************************************
// FILE -- /home/zero_rom/zero2np/src/graphics/graph3d/CDebugEdit.cpp
// *****************************************************************************

/* data 369d78 */ Rep basic_string<char, string_char_traits<char>, ctl::custom_allocator<char> >::nilRep;
/* data 369d88 */ __vtbl_ptr_type ctl::custom_allocator<char> virtual table[4];
/* data 369da8 */ __vtbl_ptr_type CEditRoot virtual table[12];
/* data 369e08 */ __vtbl_ptr_type ctl::custom_allocator<IEditObject *> virtual table[4];
/* data 369e28 */ __vtbl_ptr_type IEditObject virtual table[12];
/* sbss 3f5108 */ unsigned char IEditObject type_info node[8];
/* sbss 3f5100 */ unsigned char ctl::custom_allocator<IEditObject *> type_info node[8];
/* bss 4cda80 */ unsigned char CEditRoot type_info node[12];
/* sbss 3f5110 */ unsigned char ctl::custom_allocator<char> type_info node[8];
/* data 3f49fc */ size_t basic_string<char, string_char_traits<char>, ctl::custom_allocator<char> >::npos;

// *****************************************************************************

/* data 367a90 */ static int _sceSifInitCheck;
/* bss 4c3b80 */ static _sceRpcPacket _packet_buffer[32];
/* bss 4c4380 */ static _sceRpcPacket _free_buffer[32];
/* bss 4c4b80 */ static _sceRpcPacket _free_buffer2[32];
/* bss 4c5380 */ static _sceRpcDataTable _data_table;

// *****************************************************************************
// FILE -- /home/xokano/globe_cvs/g_28/g/ee/src/kernel/libc/filestub.c
// *****************************************************************************

/* data 367a98 */ int _sceFs_q[32];
/* data 367b18 */ static unsigned int ee_retbuf_sel;
/* data 367b1c */ static int _fs_init;
/* data 367b20 */ static int _fs_rcv_bufdbl;
/* data 367b24 */ static int _fs_semid;
/* data 367b28 */ static int _fs_iob_semid;
/* data 367b2c */ static int _fs_fsq_semid;
/* data 367b30 */ static char *_fswildcard;
/* bss 4c5400 */ static unsigned char _send_data[3136];
/* bss 4c6040 */ static unsigned char _rcv_data_rpc[64];
/* bss 4c6080 */ static unsigned char _rcv_data_cmd[2][1088];
/* bss 4c6900 */ static _sceFsIob _iob[32];
/* bss 4c6b00 */ static sceSifClientData _cd;
/* bss 4c6b28 */ static char _fsversion[4];
/* bss 4c6b40 */ static int _sif_FsRcv_Data[16];
/* bss 4c6b80 */ static int _sif_FsPoff_Data[16];
/* bss 4c6bc0 */ static void *sceCbPoff_Gp;

// *****************************************************************************
// FILE -- /home/xokano/globe_cvs/g_28/g/ee/src/kernel/libc/iopheap.c
// *****************************************************************************

/* data 367b34 */ static int _bind;
/* bss 4c6c00 */ static sceSifClientData cd;
/* bss 4c6c40 */ static unsigned int rdata[16];
/* bss 4c6c80 */ static unsigned int sdata[16];
/* bss 4c6cc0 */ static _sceLoadIHData _lih_data;

// *****************************************************************************
// FILE -- /home/xokano/globe_cvs/g_28/g/ee/src/kernel/libc/eeloadfile.c
// *****************************************************************************

/* data 367b38 */ static int _bind_check;
/* data 367b3c */ static char *_lfwildcard;
/* bss 4c6dc0 */ static _sceLoadFileData _senddata;
/* bss 4c6fc0 */ static sceSifClientData cd;
/* bss 4c6fe8 */ static char _lfversion[4];

// *****************************************************************************
// FILE -- /home/xokano/globe_cvs/g_28/g/ee/src/kernel/libc/iopreset.c
// *****************************************************************************

/* bss 4c7000 */ static sceSifCmdResetData rdata;

// *****************************************************************************
// FILE -- /home/xokano/globe_cvs/g_28/g/ee/src/kernel/libc/tlbfunc.c
// *****************************************************************************

/* data 367b40 */ static u_int tlbsrc[0];
/* data 367e70 */ void (*_kTLBRefillHandler)(/* parameters unknown */);
/* data 367e78 */ void (*_kDebugHandler[16])(/* parameters unknown */);
/* data 367eb8 */ void *_kExecArg;
/* data 367ec0 */ static struct { // 0x8
	/* 0x000 */ int num;
	/* 0x004 */ void *func;
} SysEntry[0];
/* data 367f00 */ static TLBEntry kernelTLB[0];
/* data 367fd0 */ static TLBEntry defaultTLB[0];
/* data 3680f0 */ static TLBEntry extendTLB[0];
/* data 368170 */ TLB TLBInfo;

// *****************************************************************************
// FILE -- /home/xokano/globe_cvs/g_28/g/ee/src/kernel/libc/initsys.c
// *****************************************************************************

/* data 368190 */ static int *_SyscallEntry;
/* data 368198 */ static struct { // 0x8
	/* 0x000 */ int num;
	/* 0x004 */ void *func;
} SysEntry[0];
/* data 3681a8 */ int __sce_sema_id;
/* data 3681ac */ int __sce_eh_sema_id;

// *****************************************************************************
// FILE -- /home/xokano/globe_cvs/g_28/g/ee/src/kernel/libc/libosd.c
// *****************************************************************************

/* data 3681b0 */ static u_int osdsrc[0];
/* data 368958 */ SysEntry SysExecPS2Entry[0];

// *****************************************************************************
// FILE -- /home/xokano/globe_cvs/g_28/g/ee/src/kernel/libc/exit.c
// *****************************************************************************

/* data 368970 */ static struct { // 0x8
	/* 0x000 */ int num;
	/* 0x004 */ void *func;
} SysEntry[0];

// *****************************************************************************
// FILE -- /home/xokano/globe_cvs/g_28/g/ee/src/kernel/libc/alarm.c
// *****************************************************************************

/* data 368978 */ static u_int srcfile[0];
/* data 3690b8 */ static u_int eenull[0];
/* data 3690e0 */ static struct { // 0x8
	/* 0x000 */ int num;
	/* 0x004 */ void *func;
} SysEntry[0];

// *****************************************************************************
// FILE -- /home/xokano/globe_cvs/g_28/g/ee/src/kernel/libc/timer.c
// *****************************************************************************

/* data 369120 */ static struct { // 0x20
	/* 0x000 */ u_long ulHighCount;
	/* 0x008 */ int hid;
	/* 0x00c */ u_int uniqkey;
	/* 0x010 */ u_int uiUsedCounters;
	/* 0x014 */ COUNTER *pFree;
	/* 0x018 */ COUNTER *pAlarm;
	/* 0x01c */ int cbcounterid;
} g_Timer;
/* bss 4c82c0 */ static COUNTER g_CounterBuf[128];

// *****************************************************************************
// FILE -- /home/xokano/globe_cvs/g_28/g/ee/src/kernel/libc/timeralarm.c
// *****************************************************************************

/* bss 4ca2c0 */ static ALARM g_AlarmBuf[64];
/* bss 4ca6c0 */ static ALARM *g_pFreeAlarm;

// *****************************************************************************
// FILE -- /home/xokano/globe_cvs/g_28/g/ee/src/kernel/libc/iopnotify.c
// *****************************************************************************

/* data 369140 */ static sceSifRebootNotifyData *g_pUserRebootBuf;
/* data 369144 */ static int g_iUserRebootSize;
/* bss 4ca6c8 */ static sceSifRebootNotifyData g_SysRebootBuf[32];

// *****************************************************************************
// FILE -- /home/xokano/globe_cvs/g_28/g/ee/src/kernel/libc/glue.c
