// *****************************************************************************
// FILE -- /home/zero_rom/zero2np/src/ingame/map/CBuff.c
// *****************************************************************************

/* sdata */ int CBuffNum;
/* sdata */ int CBuffMaxLen;
/* sdata */ int CBuffMaxNum;
/* sbss */ char *CBuffStr;

// *****************************************************************************
// FILE -- /home/zero_rom/zero2np/src/graphics/graph3d/CDebugEdit.cpp
// *****************************************************************************

/* data */ Rep basic_string<char, string_char_traits<char>, ctl::custom_allocator<char>>::nilRep;
/* data */ __vtbl_ptr_type ctl::custom_allocator<char> virtual table[4];
/* data */ __vtbl_ptr_type CEditRoot virtual table[12];
/* data */ __vtbl_ptr_type ctl::custom_allocator<IEditObject *> virtual table[4];
/* data */ __vtbl_ptr_type IEditObject virtual table[12];
/* sbss */ unsigned char IEditObject type_info node[8];
/* sbss */ unsigned char ctl::custom_allocator<IEditObject *> type_info node[8];
/* bss */ unsigned char CEditRoot type_info node[12];
/* sbss */ unsigned char ctl::custom_allocator<char> type_info node[8];
/* data */ size_t basic_string<char, string_char_traits<char>, ctl::custom_allocator<char>>::npos;
/* data */ bool _Alloc_traits<IEditObject *, ctl::custom_allocator<IEditObject *>>::_S_instanceless;

// *****************************************************************************

/* bss 4c3b00 */ unsigned int soft_reg[32];

// *****************************************************************************
// FILE -- /home/xokano/globe_cvs/g_28/g/ee/src/kernel/libc/sifrpc.c
// *****************************************************************************

/* data 367a90 */ int _sceSifInitCheck;
/* bss 4c3b80 */ _sceRpcPacket _packet_buffer[32];
/* bss 4c4380 */ _sceRpcPacket _free_buffer[32];
/* bss 4c4b80 */ _sceRpcPacket _free_buffer2[32];
/* bss 4c5380 */ _sceRpcDataTable _data_table;

// *****************************************************************************
// FILE -- /home/xokano/globe_cvs/g_28/g/ee/src/kernel/libc/filestub.c
// *****************************************************************************

/* data 367a98 */ int _sceFs_q[32];
/* data 367b18 */ unsigned int ee_retbuf_sel;
/* data 367b1c */ int _fs_init;
/* data 367b20 */ int _fs_rcv_bufdbl;
/* data 367b24 */ int _fs_semid;
/* data 367b28 */ int _fs_iob_semid;
/* data 367b2c */ int _fs_fsq_semid;
/* data 367b30 */ char *_fswildcard;
/* bss 4c5400 */ unsigned char _send_data[3136];
/* bss 4c6040 */ unsigned char _rcv_data_rpc[64];
/* bss 4c6080 */ unsigned char _rcv_data_cmd[2][1088];
/* bss 4c6900 */ _sceFsIob _iob[32];
/* bss 4c6b00 */ sceSifClientData _cd;
/* bss 4c6b28 */ char _fsversion[4];
/* bss 4c6b40 */ int _sif_FsRcv_Data[16];
/* bss 4c6b80 */ int _sif_FsPoff_Data[16];
/* bss 4c6bc0 */ void *sceCbPoff_Gp;

// *****************************************************************************
// FILE -- /home/xokano/globe_cvs/g_28/g/ee/src/kernel/libc/iopheap.c
// *****************************************************************************

/* data 367b34 */ int _bind;
/* bss 4c6c00 */ sceSifClientData cd;
/* bss 4c6c40 */ unsigned int rdata[16];
/* bss 4c6c80 */ unsigned int sdata[16];
/* bss 4c6cc0 */ _sceLoadIHData _lih_data;

// *****************************************************************************
// FILE -- /home/xokano/globe_cvs/g_28/g/ee/src/kernel/libc/eeloadfile.c
// *****************************************************************************

/* data 367b38 */ int _bind_check;
/* data 367b3c */ char *_lfwildcard;
/* bss 4c6dc0 */ _sceLoadFileData _senddata;
/* bss 4c6fc0 */ sceSifClientData cd;
/* bss 4c6fe8 */ char _lfversion[4];

// *****************************************************************************
// FILE -- /home/xokano/globe_cvs/g_28/g/ee/src/kernel/libc/iopreset.c
// *****************************************************************************

/* bss 4c7000 */ sceSifCmdResetData rdata;

// *****************************************************************************
// FILE -- /home/xokano/globe_cvs/g_28/g/ee/src/kernel/libc/tlbfunc.c
// *****************************************************************************

/* data 367b40 */ u_int tlbsrc[0];
/* data 367e70 */ void (*_kTLBRefillHandler)(/* parameters unknown */);
/* data 367e78 */ void (*_kDebugHandler[16])(/* parameters unknown */);
/* data 367eb8 */ void *_kExecArg;
/* data 367ec0 */ struct SysEntry[0]
{ // 0x8
    /* 0x000 */ int num;
    /* 0x004 */ void *func;
};
/* data 367f00 */ TLBEntry kernelTLB[0];
/* data 367fd0 */ TLBEntry defaultTLB[0];
/* data 3680f0 */ TLBEntry extendTLB[0];
/* data 368170 */ TLB TLBInfo;

// *****************************************************************************
// FILE -- /home/xokano/globe_cvs/g_28/g/ee/src/kernel/libc/initsys.c
// *****************************************************************************

/* data 368190 */ int *_SyscallEntry;
/* data 368198 */ struct SysEntry[0]
{ // 0x8
    /* 0x000 */ int num;
    /* 0x004 */ void *func;
};
/* data 3681a8 */ int __sce_sema_id;
/* data 3681ac */ int __sce_eh_sema_id;

// *****************************************************************************
// FILE -- /home/xokano/globe_cvs/g_28/g/ee/src/kernel/libc/libosd.c
// *****************************************************************************

/* data 3681b0 */ u_int osdsrc[0];
/* data 368958 */ SysEntry SysExecPS2Entry[0];

// *****************************************************************************
// FILE -- /home/xokano/globe_cvs/g_28/g/ee/src/kernel/libc/exit.c
// *****************************************************************************

/* data 368970 */ struct SysEntry[0]
{ // 0x8
    /* 0x000 */ int num;
    /* 0x004 */ void *func;
};

// *****************************************************************************
// FILE -- /home/xokano/globe_cvs/g_28/g/ee/src/kernel/libc/alarm.c
// *****************************************************************************

/* data 368978 */ u_int srcfile[0];
/* data 3690b8 */ u_int eenull[0];
/* data 3690e0 */ struct SysEntry[0]
{ // 0x8
    /* 0x000 */ int num;
    /* 0x004 */ void *func;
};

// *****************************************************************************
// FILE -- /home/xokano/globe_cvs/g_28/g/ee/src/kernel/libc/timer.c
// *****************************************************************************

/* data 369120 */ struct g_Timer
{ // 0x20
    /* 0x000 */ u_long ulHighCount;
    /* 0x008 */ int hid;
    /* 0x00c */ u_int uniqkey;
    /* 0x010 */ u_int uiUsedCounters;
    /* 0x014 */ COUNTER *pFree;
    /* 0x018 */ COUNTER *pAlarm;
    /* 0x01c */ int cbcounterid;
};
/* bss 4c82c0 */ COUNTER g_CounterBuf[128];

// *****************************************************************************
// FILE -- /home/xokano/globe_cvs/g_28/g/ee/src/kernel/libc/timeralarm.c
// *****************************************************************************

/* bss 4ca2c0 */ ALARM g_AlarmBuf[64];
/* bss 4ca6c0 */ ALARM *g_pFreeAlarm;

// *****************************************************************************
// FILE -- /home/xokano/globe_cvs/g_28/g/ee/src/kernel/libc/iopnotify.c
// *****************************************************************************

/* data 369140 */ sceSifRebootNotifyData *g_pUserRebootBuf;
/* data 369144 */ int g_iUserRebootSize;
/* bss 4ca6c8 */ sceSifRebootNotifyData g_SysRebootBuf[32];

// *****************************************************************************
// FILE -- /home/xokano/globe_cvs/g_28/g/ee/src/kernel/libc/glue.c
